Merge commit 'ec6834c0629c22cab766422da03598123c4f83e7' into release
