--- a/_posts/2022-08-05-uml-state-diagrams.md
+++ b/_posts/2022-08-05-uml-state-diagrams.md
@@ -89,40 +89,39 @@ The label on the connector / transition usually follows the format ``trigger [gu
-For example, turning the example of the composite _Reconnecting_ state above into a PlantUML text description: 
+For example, turning the example of the composite _Reconnecting_ state above into a Mermaid text description: 
 
 ```
-@startuml
-hide empty description
-[*] --> Reconnecting
-state Reconnecting {
-[*] --> EstablishingConnection
-EstablishingConnection --> EstablishingConnection : failed [no connection] /wait 5s then reconnect
-EstablishingConnection --> [*] : success [connection established]
-||
-[*] --> Listening
-Listening --> VerifyingAccess : key presented [valid RFID code] /verify
-VerifyingAccess --> Listening
-state VerifyingAccess{
-[*] --> CheckingInternalRecords
-CheckingInternalRecords --> KeyAccessVerified : key allowed [valid key]
-KeyAccessVerified --> Unlocked : [valid key] /unlock
-Unlocked --> [*] : wait 5 seconds after door close [unlocked] /lock
-CheckingInternalRecords --> InvalidKey : not found [invalid key] /ignore
-InvalidKey --> [*] : /ignore
-}
-}
-@enduml
+stateDiagram-v2
+  [*] --> Active
+  state Active {
+    [*] --> Reconnecting
+    Reconnecting --> EstablishingConnection
+    EstablishingConnection --> Reconnecting : failed [no connection] /wait 5s then reconnect
+    EstablishingConnection --> [*] : success [connection established]
+  --
+  [*] --> Listening
+  Listening  --> VerifyingAccess : key presented [valid RFID code] /verify
+  VerifyingAccess --> [*]
+    state VerifyingAccess{
+      [*] --> CheckingInternalRecords
+      CheckingInternalRecords --> KeyAccessVerified : key allowed [valid key]
+      KeyAccessVerified --> Unlocked : [valid key] /unlock
+      Unlocked --> [*] : wait 5 seconds after door close [unlocked] /lock
+      CheckingInternalRecords --> InvalidKey : not found [invalid key] /ignore
+      InvalidKey --> [*] : /ignore
+    }
+  }
 ```
 
-<img src="/assets/img/blog/uml-state-diagram-plantuml.png" style="width=100%;max-width:600px;height:auto;" alt="The Reconnecting sub-state diagram converted into text with PlantUML and a diagram generated automatically in draw.io">
+<img src="/assets/img/blog/uml-state-diagram-mermaid.png" style="width=100%;max-width:600px;height:auto;" alt="The Reconnecting sub-state diagram converted into text with Mermaid and a diagram generated automatically in draw.io">
